In [2]:
import pandas as pd

In [4]:
df=pd.read_csv('https://raw.githubusercontent.com/TheCuriousNeuron/Credit-Card-Behaviour-Score-Prediction-/refs/heads/main/train_dataset_final1.csv')

In [6]:
df.head()

,Customer_ID,marriage,sex,education,LIMIT_BAL,age,pay_0,pay_2,pay_3,pay_4,...,Bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6,AVG_Bill_amt,PAY_TO_BILL_ratio,next_month_default
0,5017,2,0,2,60000,25.0,2,2,2,0,...,20750.63,2000.21,0.00,1134.85,1821.78,1500.03,1500.24,41511.50,0.03,0
1,5018,2,1,1,290000,24.0,0,0,-2,-2,...,1350.30,0.00,0.17,0.00,2700.10,0.00,1349.72,2534.50,0.27,0
2,5019,1,0,2,180000,63.0,0,0,0,0,...,52991.51,2086.94,2199.99,1845.66,2000.35,1923.00,1999.78,50422.00,0.04,0
3,5020,1,1,2,210000,43.0,0,0,0,0,...,76945.47,3348.07,3380.91,3400.45,2683.97,2744.00,2892.10,86229.50,0.04,0
4,5021,2,0,1,280000,32.0,-2,-2,-2,-2,...,1.35,999.78,3186.27,45027.78,2100.09,0.01,0.27,11814.33,0.72,0

In [8]:
df.isnull().sum()

Customer_ID             0
marriage                0
sex                     0
education               0
LIMIT_BAL               0
age                   126
pay_0                   0
pay_2                   0
pay_3                   0
pay_4                   0
pay_5                   0
pay_6                   0
Bill_amt1               0
Bill_amt2               0
Bill_amt3               0
Bill_amt4               0
Bill_amt5               0
Bill_amt6               0
pay_amt1                0
pay_amt2                0
pay_amt3                0
pay_amt4                0
pay_amt5                0
pay_amt6                0
AVG_Bill_amt            0
PAY_TO_BILL_ratio       0
next_month_default      0
dtype: int64

In [10]:
df.duplicated().sum()

0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25247 entries, 0 to 25246
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         25247 non-null  int64
 1   marriage            25247 non-null  int64
 2   sex                 25247 non-null  int64
 3   education           25247 non-null  int64
 4   LIMIT_BAL           25247 non-null  int64
 5   age                 25121 non-null  float64
 6   pay_0               25247 non-null  int64
 7   pay_2               25247 non-null  int64
 8   pay_3               25247 non-null  int64
 9   pay_4               25247 non-null  int64
 10  pay_5               25247 non-null  int64
 11  pay_6               25247 non-null  int64
 12  Bill_amt1           25247 non-null  float64
 13  Bill_amt2           25247 non-null  float64
 14  Bill_amt3           25247 non-null  float64
 15  Bill_amt4           25247 non-null  float64
 16  Bill_amt5           25247 non-null  float64
 17  Bill_amt6           25247 non-null  float64
 18  pay_amt1            25247 non-null  float64
 19  pay_amt2            25247 non-null  float64
 20  pay_amt3            25247 non-null  float64
 21  pay_amt4            25247 non-null  float64
 22  pay_amt5            25247 non-null  float64
 23  pay_amt6            25247 non-null  float64
 24  AVG_Bill_amt        25247 non-null  float64
 25  PAY_TO_BILL_ratio   25247 non-null  float64
 26  next_month_default  25247 non-null  int64
dtypes: float64(15), int64(12)
memory usage: 5.2 MB

In [22]:
df['age'] = pd.to_numeric(df['age'], errors='coerce')
df['age'].fillna(df['age'].median(), inplace=True)
df['age'] = df['age'].round().astype(int)

/var/folders/24/l6x0hdsx0z75kslgzbwj1_cw0000gn/T/ipykernel_33172/1817544812.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].median(), inplace=True)

In [24]:
df['age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 25247 entries, 0 to 25246
Series name: age
Non-Null Count  Dtype
--------------  -----
25247 non-null  int64
dtypes: int64(1)
memory usage: 197.4 KB

In [26]:
df['marriage'].unique()

array([2, 1, 3, 0])

In [30]:
df['marriage'].value_counts()

marriage
2    13441
1    11480
3      273
0       53
Name: count, dtype: int64

In [32]:
df['marriage'] = df['marriage'].replace(0, 3)

In [34]:
df['sex'].value_counts()

sex
1    15252
0     9995
Name: count, dtype: int64

In [36]:
df['education'].value_counts()

education
2    11717
1     8988
3     4115
5      253
4      116
6       44
0       14
Name: count, dtype: int64

In [38]:
df['education']=df['education'].replace([0,5,6],4)

In [40]:
df['marriage'].value_counts()

marriage
2    13441
1    11480
3      326
Name: count, dtype: int64

In [42]:
df['education'].value_counts()

education
2    11717
1     8988
3     4115
4      427
Name: count, dtype: int64